/* 
Задание: Дан массив с числами. Узнайте сколько элементов с начала массива надо сложить, чтобы в сумме получилось больше 10-ти.
*/


/* я знаю что тут все не то, помогииииииттееее*/ 
public class Main {
    public static void main(String[] args) {
        int [] nums = {2,4,3,4,5,7};
        int sum = 0;
        for (int i = 0; i < nums.length; i++) {
            System.out.println(sum > 10);
        }
    }
}
